Revit 2024 API
RevitAPIEventArgs Properties
The RevitAPIEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace